using System.Windows;

namespace Lab_01
{
    /*
    Прогляньте структуру System.DateTime. Цей тип містить велику кількість функціоналу, що дозволяє користувачеві виконувати різноманітні операції з датою та часом. 
    Використовуйте System.DateTime разом з технологією WPF для реалізації простої програми C #, яка виконує наступне:

    Попросіть користувача ввести дату свого народження.Для цього використайте елемент управління DatePicker або аналогічний для роботи з датами.
    Розрахуйте вік користувача.
    Перевірте, чи вік користувача правильний. Наприклад, якщо користувач ще не народився чи йому більше ніж 135 років, виведіть повідомлення про помилку. (використайте клас MessageBox для відображення)
    Виведіть вік користувача в TextBlock
    Якщо сьогодні день народження користувача, виведіть приємне повідомлення.
    Обчисліть знак зодіаку користувача відповідно до західної та китайської астрологічної системи. Якщо ви не знайомі з цими астрологічними системами, перегляньте їх в Інтернеті.
    Виведіть обидва знаки зодіаку в TextBlock-и.
    Правила виконання роботи:

    Застосунок повинен бути написаний згідно з правилами MVVM.
    Дотримуйтесь правил Name Convention для C#.
    Застосунок повинен відповідати всім описаним вимогам.
    Застосунок не повинен аварійно завершатись.
    Заливайте посиланням на репозиторій. Не забудьте видалити bin та obj папки перед комітом.
    */
    public partial class MainWindow : Window
    {
        public MainWindow()
        {
            InitializeComponent();
            DataContext = new BirthDateViewModel();
        }
    }
}
